#Дан список чисел, необходимо его развернуть без использования метода revese и
#функции reversed, а так же дополнительного списка и среза

numberslist = [2, 6, 8, 10, 12]
#for i in numberslist[::-1]: print(i,"\n")

numberslist2 = numberslist[::-1]
print(numberslist2)